eisup_2019_docmng_integration/src/Documents/абс_ПередачаОСМеждуФиллиалами/абс_ПередачаОСМеждуФиллиалами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_ПередачаОСМеждуФиллиалами</name>
  <posting>Deny</posting>
  <attributes>
    <name>ОрганизацияИсточник</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияПриемник</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументСписаниеОС</name>
    <type>
      <types>DocumentRef.СписаниеОС</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументВводОстатковОС</name>
    <type>
      <types>DocumentRef.ВводНачальныхОстатковОС</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетБУ</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетНУ</name>
    <type>
      <types>ChartOfAccountsRef.Налоговый</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаСписания</name>
    <type>
      <types>CatalogRef.ПричиныСписания</types>
    </type>
  </attributes>
  <attributes>
    <name>Событие</name>
    <type>
      <types>CatalogRef.СобытияОС</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыПередачаОСМеждуФиллиалами</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ОбособленноеПодразделение</name>
    <type>
      <types>CatalogRef.абс_ОбособленныеПодразделения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОС</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>ОсновноеСредство</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>ОсновноеСредствоПриемник</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <comment>(Упр)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Амортизация</name>
      <comment>(Упр)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АмортизацияЗаМесяц</name>
      <comment>(Упр)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СписаноНаЗатраты</name>
      <comment>(Общ)</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьБУ</name>
      <comment>(Регл)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АмортизацияБУ</name>
      <comment>(Регл)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АмортизацияЗаМесяцБУ</name>
      <comment>(Регл)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СписаноНаЗатратыБУ</name>
      <comment>(Регл)</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьНУ</name>
      <comment>(Регл)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АмортизацияНУ</name>
      <comment>(Регл)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АмортизацияЗаМесяцНУ</name>
      <comment>(Регл)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКапитальныхВложенийВключаемыхВРасходыНУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекущаяСтоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекущаяСтоимостьБУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекущаяСтоимостьНУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособОтражения</name>
      <type>
        <types>CatalogRef.СпособыОтраженияРасходовПоАмортизации</types>
      </type>
    </attributes>
    <attributes>
      <name>МОЛ</name>
      <comment>Выбирается из списка регистра сведений &quot;Работники организаций&quot;</comment>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>НачислятьПоБазовойСтоимостиНУ</name>
      <comment>(Регл)</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПереходаКРасчетуПоБазовойСтоимостиНУ</name>
      <comment>(Регл)</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическийСрокИспользованияНУ</name>
      <comment>(Регл)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьПР</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьВР</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АмортизацияПР</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АмортизацияВР</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АмортизацияЗаМесяцПР</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АмортизацияЗаМесяцВР</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/Enums/абс_СтатусыПередачаОСМеждуФиллиалами/абс_СтатусыПередачаОСМеждуФиллиалами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыПередачаОСМеждуФиллиалами</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаБухгалтером</name>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
  </enumValues>
  <enumValues>
    <name>Корректировка</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаФилиалом</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Documents/абс_ПередачаОСМеждуФиллиалами/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Статус = Перечисления.абс_СтатусыПередачаОСМеждуФиллиалами.Подготовка;
	Ответственный = глЗначениеПеременной("глТекущийПользователь");
	Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
	СчетБУ = ПланыСчетов.Хозрасчетный.РасчетыПоВыделенномуИмуществу;
	СчетНУ = ПланыСчетов.Налоговый.НайтиПоКоду("79.01");
	ПричинаСписания = Справочники.ПричиныСписания.НайтиПоКоду("000000013");
	Событие = Справочники.СобытияОС.НайтиПоКоду("000000011");
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Статус 					= Перечисления.абс_СтатусыПередачаОСМеждуФиллиалами.Подготовка;
	ДокументВводОстатковОС 	= Документы.ВводНачальныхОстатковОС.ПустаяСсылка();
	ДокументСписаниеОС 		= Документы.СписаниеОС.ПустаяСсылка();
	Ответственный = глЗначениеПеременной("глТекущийПользователь");
	Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
	СчетБУ = ПланыСчетов.Хозрасчетный.РасчетыПоВыделенномуИмуществу;
	СчетНУ = ПланыСчетов.Налоговый.НайтиПоКоду("79.01");
	ПричинаСписания = Справочники.ПричиныСписания.НайтиПоКоду("000000013");
	Событие = Справочники.СобытияОС.НайтиПоКоду("000000011");
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("СоздаватьДокументы", Ложь);
	
	Если ПометкаУдаления Тогда 
		абс_БизнесПроцессыПривелегированный.ПометитьНаУдалениеДокументыВводаОстатков(Новый Структура("СсылкаНаОбъект",Ссылка));
	КонецЕсли;
	
	//Если НЕ ЭтоНовый() Тогда 
	//	Если Ссылка.Статус <> Перечисления.абс_СтатусыПередачаОСМеждуФиллиалами.Завершен
	//		И Статус = Перечисления.абс_СтатусыПередачаОСМеждуФиллиалами.Завершен
	//		И (НЕ ПометкаУдаления) Тогда 
	//		СтруктураДокументы = абс_БизнесПроцессыПривелегированный.СоздатьПустыеДокументы(Новый Структура("СсылкаНаОбъект",Ссылка), ОрганизацияИсточник, ОрганизацияПриемник, Дата);
	//		
	//		ДокументСписаниеОС       =  СтруктураДокументы.ДокументСписаниеОС;
	//		ДокументВводОстатковОС   =  СтруктураДокументы.ДокументВводОстатковОС;
	
	//		ДополнительныеСвойства.СоздаватьДокументы = Истина;
	//	КонецЕсли;
	//КонецЕсли;
	
	Если Статус = Перечисления.абс_СтатусыПередачаОСМеждуФиллиалами.ОбработкаБухгалтером И (НЕ ПометкаУдаления) Тогда 
		СтруктураДокументы = абс_БизнесПроцессыПривелегированный.СоздатьПустыеДокументы(Новый Структура("СсылкаНаОбъект",Ссылка), ОрганизацияИсточник, ОрганизацияПриемник, Дата);
		ДокументСписаниеОС       =  СтруктураДокументы.ДокументСписаниеОС;
		ДополнительныеСвойства.СоздаватьДокументы = Истина;
		
		мДокументСписаниеОС     = абс_БизнесПроцессыПривелегированный.СоздатьСписаниеОС(Новый Структура("СсылкаНаОбъект,ДокументСписаниеОС",Ссылка,ДокументСписаниеОС));
		ДокументСписаниеОС     =  мДокументСписаниеОС.ДокументСписаниеОС;
		
		//абс_БизнесПроцессыПривелегированный.ПровестиДокументПоОС(Новый Структура("СсылкаНаОбъект",ДокументСписаниеОС));
		
	КонецЕсли;
	
// {{KM WARE Лазаревский К.В. Заявка № 23.09.2015 начало
// принимающая сторона может быть и КЦ
// {{Старый код:
//	Если Статус = Перечисления.абс_СтатусыПередачаОСМеждуФиллиалами.ОбработкаФилиалом 
// }}Новый код:
Если ((Статус = Перечисления.абс_СтатусыПередачаОСМеждуФиллиалами.ОбработкаФилиалом ИЛИ Статус = Перечисления.абс_СтатусыПередачаОСМеждуФиллиалами.ОбработкаБухгалтером ) 
	

// {{KM WARE Малыгин П.К. Заявка № 24.11.2015 начало
// Проверка на филиал не нужна. Существуют передачи из головной организации в филиалы
//И ОрганизацияИсточник.абс_СтатусОрганизации = Перечисления.абс_СтатусОрганизации.Филиал)
// }}KM WARE Малыгин П.К. Заявка № 24.11.2015 окончание 

// }}KM WARE Лазаревский К.В. Заявка № 23.09.2015 окончание 		
		И (НЕ ПометкаУдаления)) Тогда 
		СтруктураДокументы = абс_БизнесПроцессыПривелегированный.СоздатьПустыеДокументы(Новый Структура("СсылкаНаОбъект",Ссылка), ОрганизацияИсточник, ОрганизацияПриемник, Дата);
		ДокументВводОстатковОС   =  СтруктураДокументы.ДокументВводОстатковОС;
		ДополнительныеСвойства.СоздаватьДокументы = Истина;
		
		мДокументВводОстатковОС = абс_БизнесПроцессыПривелегированный.СоздатьВводНачальныхОстатков(Новый Структура("СсылкаНаОбъект,ДокументВводОстатковОС",Ссылка,ДокументВводОстатковОС));
		ДокументВводОстатковОС = мДокументВводОстатковОС.ДокументВводОстатковОС;
		
		//абс_БизнесПроцессыПривелегированный.ПровестиДокументПоОС(Новый Структура("СсылкаНаОбъект",ДокументВводОстатковОС));
		
	КонецЕсли;
	
	
	//Если Статус = Перечисления.абс_СтатусыПередачаОСМеждуФиллиалами.Завершен И (НЕ ПометкаУдаления) Тогда 
	//	Если ЗначениеЗаполнено(ДокументВводОстатковОС) Тогда
	//		Если Не ЗначениеЗаполнено(ДокументВводОстатковОС.абс_Обособленное) ИЛИ абс_ОбособленноеПодразделение <> ДокументВводОстатковОС.абс_Обособленное Тогда
	//			
	//			абс_БизнесПроцессыПривелегированный.ДополнитьДокументВводОстатков(Новый Структура("СсылкаНаОбъект,ОбособленноеПодразделение,Подразделение,ПодразделениеОрганизации",ДокументВводОстатковОС,абс_ОбособленноеПодразделение,Подразделение,ПодразделениеОрганизации));
	//			
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
	
	Если Статус = Перечисления.абс_СтатусыПередачаОСМеждуФиллиалами.Отказ Тогда
		абс_БизнесПроцессыПривелегированный.ДокументыПередачиОСВОтказ(Новый Структура("ДокументСписаниеОС,ДокументВводОстатковОС",ДокументСписаниеОС,ДокументВводОстатковОС));	
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	//Если ДополнительныеСвойства.Свойство("СоздаватьДокументы") Тогда	
	//	Если ДополнительныеСвойства.СоздаватьДокументы Тогда  
	//		мДокументСписаниеОС     = абс_БизнесПроцессыПривелегированный.СоздатьСписаниеОС(Новый Структура("СсылкаНаОбъект",Ссылка));
	//		ДокументСписаниеОС     =  мДокументСписаниеОС.ДокументСписаниеОС;
	//		
	//		мДокументВводОстатковОС = абс_БизнесПроцессыПривелегированный.СоздатьВводНачальныхОстатков(Новый Структура("СсылкаНаОбъект",Ссылка));
	//		ДокументВводОстатковОС = мДокументВводОстатковОС.ДокументВводОстатковОС;
	//	КонецЕсли;
	//КонецЕсли;
	
	//Если Статус = Перечисления.абс_СтатусыПередачаОСМеждуФиллиалами.ОбработкаБухгалтером И (НЕ ПометкаУдаления) Тогда
	//	мДокументСписаниеОС     = абс_БизнесПроцессыПривелегированный.СоздатьСписаниеОС(Новый Структура("СсылкаНаОбъект",Ссылка));
	//	ДокументСписаниеОС     =  мДокументСписаниеОС.ДокументСписаниеОС;
	//	
	//	абс_БизнесПроцессыПривелегированный.ПровестиДокументПоОС(Новый Структура("СсылкаНаОбъект",ДокументСписаниеОС));
	//	
	//КонецЕсли;
	//
	//Если Статус = Перечисления.абс_СтатусыПередачаОСМеждуФиллиалами.Завершен И (НЕ ПометкаУдаления) Тогда
	//	мДокументВводОстатковОС = абс_БизнесПроцессыПривелегированный.СоздатьВводНачальныхОстатков(Новый Структура("СсылкаНаОбъект",Ссылка));
	//	ДокументВводОстатковОС = мДокументВводОстатковОС.ДокументВводОстатковОС;
	//	
	//	абс_БизнесПроцессыПривелегированный.ПровестиДокументПоОС(Новый Структура("СсылкаНаОбъект",ДокументВводОстатковОС));
	//	
	//КонецЕсли;
	//
	//
	//Если Статус = Перечисления.абс_СтатусыПередачаОСМеждуФиллиалами.Отказ Тогда
	//	
	//	абс_БизнесПроцессыПривелегированный.ПометитьНаУдалениеДокументыВводаОстатков(Новый Структура("СсылкаНаОбъект",Ссылка));
	//	
	//КонецЕсли;
	
КонецПроцедуры
